package gr.aueb.cf.ch10;

/** Έστω ένας πίνακας n ακεραίων. Τότε ο maximum sum subarray ο είναι ο συνεχόμενος
 υποπίνακας (contiguous subarray - δυνητικά κενό) με το μεγαλύτερο άθροισμα.
 Σχεδιάστε έναν γραμμικό αλγόριθμο (με πολυπλοκότητα O(n)) για να επιλύσετε τα
 παραπάνω πρόβλημα. Για παράδειγμα, αν έχουμε τον πίνακα {−2, 1, −3, 4, −1, 2, 1,
 −5, 4} τότε ο συνεχόμενος υποπίνακας με το μέγιστο άθροισμα είναι ο {4, −1, 2, 1},
 του οποίου το άθροισμα είναι 6.



 * Η πολυπλοκότητα χρόνου είναι O(n) λόγω της χρήσης μίας for.
 * Αρχικά, δημιουργούμε μία μέθοδο max που επιστρέφει τον τελικό πίνακα. Εντός της μεθόδου αρχικοποιούμε όλες
 * τις μεταβλητές στο πρώτο στοιχείο του πίνακα και τη θέση.
 * Σε κάθε επανάληψη υπολογίζουμε τη μεταβλητή max με το μέγιστο μεταξύ του τρέχοντος στοιχείου (arr[i])
 * και του αθροίσματος του ήδη καταχωρημένου μεγίστου με το τρέχον στοιχείο (max+arr[i]).
 * Αν το (max+arr[i]) είναι μικρότερο του τρέχοντος στοιχείου, αυξάνουμε την τρέχουσα θέση κατά ένα και την εκχωρούμε στη βοηθητική μεταβλητή position.
 * Αν το τοπικό μέγιστο, δηλαδή το άθροισμα των μέχρι τώρα στοιχείων, είναι μικρότερο του max, τότε
 * το τοπικό μέγιστο παίρνει την τιμή του max, η start την τιμή της position και η end την τρέχουσα θέση, ώστε να ξέρουμε σε ποιο υποπίνακα βρισκόμαστε.
 * Όταν προσπελάσουμε όλο τον πίνακα, παίρνουμε τον υποπίνακα από τις θέσεις start έως end και γεμίζουμε έναν δεύτερο πίνακα.
 * Επιστρέφουμε στη main τον δεύτερο πίνακα και εκτυπώνουμε.
 */
public class Project2 {
    public static void main(String[] args) {
        int[] arr = new int[] {-2, 1, -3, 4, -1, 2, 1, -5, 4};
        int[] arrMax = max(arr);

        for (int i = 0; i < arrMax.length; i++) {
            System.out.printf("%d ", arrMax[i]);
        }
    }

    public static int[] max(int[] arr) {
        int max = arr[0];
        int localMax = arr[0];
        int position = 0;
        int start = 0;
        int end = 0;


        for (int i = 0; i < arr.length; i++) {
            max = Math.max(max+arr[i], arr[i]);
            //System.out.println(max);

            if(max+arr[i] < arr[i]){
                position = i + 1;
            }

            if(localMax < max) {
                localMax = max;
                start = position;
                end = i;
            }
        }

        int[] arr2 = new int[end-start+1];
        //System.out.println(start);
        //System.out.println(end);
        for (int i = start;  i <= end; i++) {
            arr2[i-start] = arr[i];
        }
        return arr2;
    }
}
